export const introText = `Я задам тебе загадку
Ты придумаешь отгадку
Это слово лишь одно,
Но рифмуется оно.`;

const riddleTexts = [
  `Если хочешь ты читать,
Ты должна все буквы знать.
Их в порядке все хранит
В одном месте _______.`,

  `Помидоры, огурцы
Посадила с мамой ты,
Баклажаны, сельдерей
Множество других вещей,
Но засохнут все они
Если нет в земле _____.`,

  `Во дворе темным-темно
Не видать там ничего,
Но нам лампа не нужна
Если в небе есть ____.`,

  `Что ни лает, ни кусает,
Но и в дом нас не пускает.
Чтобы в дом нам свой войти
Мы должны иметь _____ _ ______.`,

  `Крыльев нету у него,
Но летает хорошо.
Без разбега его взлёт
Эта птица ________.`,

  `Хоть я в зеркало смотрю
Но себя не узнаю
Смотрит на меня павлин
Видно праздник ________.`,

  `В небе солнышко сияет
Только что была гроза,
Разноцветным полукругом
Даже выше, чем гора
В небе ______ видна.`,

  `Она не мурлыкает и не чирикает,
Она и не лает, и не рычит,
Она не мычит и не кукарекает,
Она почему-то всё время молчит.
Но странно ещё что её голова
К телу без шеи прикреплена.
Она рифмуется со словом глыба
Уже догадалась ты, что это ____.`,

  `Есть зелёные ребятки
Все они растут на грядке
Очень дружная семья
Их разнять почти нельзя
Где недавно было пусто
Там сейчас растёт _______.`,

  `Что такое – две ноги,
Ни руки, ни головы.
С ним в мозаику играешь
И крупинки собираешь.
Он поможет выбрать цвет
Называется ______.`,

  `С ним рассталась ты вчера
И не встретишь никогда
Целый год ты с ним была,
Он был третий у тебя,
Но сейчас пришёл четвёртый
И ты будешь с ним опять
Целый год дружить, играть,
Но как только год пройдёт,
То и этот друг уйдёт,
Так меняются друзья
На твой _____ ________
Догадалась кто уйдёт
Правильно, твой ______ ___.`,
];

export default [
  {
    riddleText: riddleTexts[0],
    answerPhoto: "1_алфавит.jpg",
  },
  {
    riddleText: riddleTexts[1],
    answerPhoto: "2_вода.jpg",
  },
  {
    riddleText: riddleTexts[2],
    answerPhoto: "3_луна.jpg",
  },
  {
    riddleText: riddleTexts[3],
    answerPhoto: "4_замок_с_ключом.jpg",
  },
  {
    riddleText: riddleTexts[4],
    answerPhoto: "5_вертолёт.jpg",
  },
  {
    riddleText: riddleTexts[5],
    answerPhoto: "6_халловин.jpg",
  },
  {
    riddleText: riddleTexts[6],
    answerPhoto: "7_радуга.jpg",
  },
  {
    riddleText: riddleTexts[7],
    answerPhoto: "8_рыба.jpg",
  },
  {
    riddleText: riddleTexts[8],
    answerPhoto: "9_капуста.jpg",
  },
  {
    riddleText: riddleTexts[9],
    answerPhoto: "10_пинцет.jpg",
  },
  {
    riddleText: riddleTexts[10],
    answerPhoto: "11_денрь_рождения.jpg",
    answerPhoto2: "11_Третий_год.jpg",
  },
];
