export const introText = `Я задам тебе загадку
Ты придумаешь отгадку
Это слово лишь одно,
Но рифмуется оно.`;

const riddleTexts = [
  `Чтобы книжку прочитать
Надо нам все буквы знать
Буквы вместе все хранит
В одном месте _______`,

  `Помидоры, огурцы
Посадила с мамой ты,
Баклажаны, сельдерей
Множество других вещей,
Но засохнут все они
Если нет в земле _____`,

  `Во дворе темным темно
Нам не видно ничего,
Но нам лампа не нужна
Если в небе ест ____`,

  `Что ни лает, ни кусает,
Но и в дом нас не пускает.
Чтобы в дом нам свой войти
Мы должны иметь _____`,

  `Крыльев нету у него,
Но летает хорошо.
Без разбега его взлёт
Эта птица ________`,

  `Хоть я в зеркало смотрю
Но себя не узнаю
Смотрит на меня павлин
Видно праздник ________`,

  `В небе солнышко сияет
Только что была гроза,
И красивым полукругом
Разноцветным изумрудом
Даже выше, чем гора
В небе ______ видна.`,

  `Она не мурлыкает и не чирикает,
Она и не лает, и не рычит,
Она не мычит и не кукарекает,
Она почему-то всё время молчит.
Но странно ещё что её голова
К телу без шеи прикреплена.
Её рифмовать можно со словом глыба
Уже догадалась ты, что это ____`,
];

export default [
  {
    riddleText: riddleTexts[0],
    answerPhoto: "1_алфавит.jpg",
  },
  {
    riddleText: riddleTexts[1],
    answerPhoto: "2_вода.jpg",
  },
  {
    riddleText: riddleTexts[2],
    answerPhoto: "3_луна.jpg",
  },
  {
    riddleText: riddleTexts[3],
    answerPhoto: "4_ключи.jpg",
  },
  {
    riddleText: riddleTexts[4],
    answerPhoto: "5_вертолёт.jpg",
  },
  {
    riddleText: riddleTexts[5],
    answerPhoto: "6_халловин.jpg",
  },
  {
    riddleText: riddleTexts[6],
    answerPhoto: "7_радуга.jpg",
  },
  {
    riddleText: riddleTexts[7],
    answerPhoto: "8_рыба.jpg",
  },
];
